Add web fe api arch
